In [2]:
import pandas as pd
import numpy as np

In [5]:
etiquetas  =['a', 'b', 'c', 'd', 'e', 'f' ]
datos = np.arange(4,10)
serie = pd.Series(datos, index=etiquetas)

In [6]:
serie

a    4
b    5
c    6
d    7
e    8
f    9
dtype: int32

In [7]:
#acceder valor
serie['c']

6

In [8]:
#datos de distintos tipos
datos = ['Jose', 49, 'Mari', 46]
serie = pd.Series(datos)
serie

0    Jose
1      49
2    Mari
3      46
dtype: object

In [9]:
#datos directos
serie = pd.Series([1000, 2000, 500, 700], ['Emp01', 'Emp02', 'Emp03', 'Emp04'])
serie

Emp01    1000
Emp02    2000
Emp03     500
Emp04     700
dtype: int64

In [4]:
# dataframes
filas = ['tienda1', 'tienda2', 'tienda3', 'tienda4']
columnas = ['articulo1', 'articulo2', 'articulo3']
datos = [[124,100,200], [200,100,300], [300,100,400], [150,250,350]]

dataframe = pd.DataFrame(datos, index=filas, columns=columnas)
dataframe

         articulo1  articulo2  articulo3
tienda1        124        100        200
tienda2        200        100        300
tienda3        300        100        400
tienda4        150        250        350

In [11]:
# seleccion fila
dataframe.loc['tienda1']
#dataframe.loc[['tienda2', 'tienda3']]

         articulo1  articulo2  articulo3
tienda2        200        100        300
tienda3        300        100        400

In [12]:
#Seleccion columna

dataframe['articulo1']

tienda1    124
tienda2    200
tienda3    300
tienda4    150
Name: articulo1, dtype: int64

In [21]:
# elemento en concreto

dataframe.loc['tienda2', 'articulo3']

300

In [43]:
# añadir una nueva columna

dataframe['articulo4'] = 25
dataframe

         articulo1  articulo2  articulo3  articulo4  Total
tienda1        124        100        200         25    449
tienda2        200        100        300         25    625
tienda3        300        100        400         25    825
tienda4        150        250        350         25    775

In [44]:
# Añadir la columna total
dataframe['Total'] = dataframe['articulo1']+dataframe['articulo2']+dataframe['articulo3']+dataframe['articulo4'] 
dataframe

         articulo1  articulo2  articulo3  articulo4  Total
tienda1        124        100        200         25    449
tienda2        200        100        300         25    625
tienda3        300        100        400         25    825
tienda4        150        250        350         25    775

In [45]:
dataframe

         articulo1  articulo2  articulo3  articulo4  Total
tienda1        124        100        200         25    449
tienda2        200        100        300         25    625
tienda3        300        100        400         25    825
tienda4        150        250        350         25    775

In [46]:
# Eliminar columna

dataframe.drop(['Total'], axis = 1)  # No la elimina realmente, solo la presenta sin la columna seleccionada

dataframe = dataframe.drop(['Total'], axis = 1)  # Elimina la columana permanentemente
# dataframe.drop(['Total'], axis = 1, inplace = True)   # Otra Manera de eliminar permanentemente una columna
dataframe

         articulo1  articulo2  articulo3  articulo4
tienda1        124        100        200         25
tienda2        200        100        300         25
tienda3        300        100        400         25
tienda4        150        250        350         25

In [48]:
# Cambiar los indices
dataframe['indices'] = '1 2 3 4'.split()
dataframe = dataframe.set_index('indices')
dataframe

         articulo1  articulo2  articulo3  articulo4
indices
1              124        100        200         25
2              200        100        300         25
3              300        100        400         25
4              150        250        350         25

In [49]:
# Reeplazar valores, por ejemplo reemplazar los valores nulos por la media

media = dataframe.mean()
dataframe.fillna(value = media, inplace = True )

In [50]:
dataframe

         articulo1  articulo2  articulo3  articulo4
indices
1              124        100        200         25
2              200        100        300         25
3              300        100        400         25
4              150        250        350         25

In [51]:
# unir dos dataframe

data1 = dataframe.copy()
data2 = dataframe.copy()
dataTotal = pd.concat([data1, data2], axis = 0)
dataTotal

         articulo1  articulo2  articulo3  articulo4
indices
1              124        100        200         25
2              200        100        300         25
3              300        100        400         25
4              150        250        350         25
1              124        100        200         25
2              200        100        300         25
3              300        100        400         25
4              150        250        350         25

In [54]:
dataTotal['articulo3'].unique()
dataTotal['articulo3'].value_counts()

articulo3
200    2
300    2
400    2
350    2
Name: count, dtype: int64

In [56]:
dataTotal.to_csv('dataTotal')

In [59]:
dataframe = pd.read_csv('D:/UNEMI/Cursos/Ciencia de datos con Python/dataTotal', index_col = 0)
dataframe

         articulo1  articulo2  articulo3  articulo4
indices
1              124        100        200         25
2              200        100        300         25
3              300        100        400         25
4              150        250        350         25
1              124        100        200         25
2              200        100        300         25
3              300        100        400         25
4              150        250        350         25

In [1]:
import Modulos as mod

ModuleNotFoundError: No module named 'Modulos'